; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem roverprob30591) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 - Rover
	rover0store rover1store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 waypoint11 - Waypoint
	camera0 camera1 camera2 - Camera
	objective0 objective1 objective2 objective3 - Objective
	)
(:init
	(visible waypoint0 waypoint1)
	(visible waypoint1 waypoint0)
	(visible waypoint0 waypoint4)
	(visible waypoint4 waypoint0)
	(visible waypoint0 waypoint10)
	(visible waypoint10 waypoint0)
	(visible waypoint1 waypoint4)
	(visible waypoint4 waypoint1)
	(visible waypoint2 waypoint1)
	(visible waypoint1 waypoint2)
	(visible waypoint2 waypoint9)
	(visible waypoint9 waypoint2)
	(visible waypoint3 waypoint1)
	(visible waypoint1 waypoint3)
	(visible waypoint3 waypoint4)
	(visible waypoint4 waypoint3)
	(visible waypoint3 waypoint6)
	(visible waypoint6 waypoint3)
	(visible waypoint3 waypoint9)
	(visible waypoint9 waypoint3)
	(visible waypoint4 waypoint5)
	(visible waypoint5 waypoint4)
	(visible waypoint4 waypoint7)
	(visible waypoint7 waypoint4)
	(visible waypoint4 waypoint10)
	(visible waypoint10 waypoint4)
	(visible waypoint5 waypoint0)
	(visible waypoint0 waypoint5)
	(visible waypoint5 waypoint3)
	(visible waypoint3 waypoint5)
	(visible waypoint6 waypoint0)
	(visible waypoint0 waypoint6)
	(visible waypoint6 waypoint8)
	(visible waypoint8 waypoint6)
	(visible waypoint6 waypoint10)
	(visible waypoint10 waypoint6)
	(visible waypoint6 waypoint11)
	(visible waypoint11 waypoint6)
	(visible waypoint7 waypoint0)
	(visible waypoint0 waypoint7)
	(visible waypoint7 waypoint1)
	(visible waypoint1 waypoint7)
	(visible waypoint7 waypoint11)
	(visible waypoint11 waypoint7)
	(visible waypoint8 waypoint0)
	(visible waypoint0 waypoint8)
	(visible waypoint8 waypoint1)
	(visible waypoint1 waypoint8)
	(visible waypoint8 waypoint2)
	(visible waypoint2 waypoint8)
	(visible waypoint8 waypoint4)
	(visible waypoint4 waypoint8)
	(visible waypoint8 waypoint9)
	(visible waypoint9 waypoint8)
	(visible waypoint9 waypoint0)
	(visible waypoint0 waypoint9)
	(visible waypoint9 waypoint1)
	(visible waypoint1 waypoint9)
	(visible waypoint9 waypoint10)
	(visible waypoint10 waypoint9)
	(visible waypoint10 waypoint2)
	(visible waypoint2 waypoint10)
	(visible waypoint10 waypoint3)
	(visible waypoint3 waypoint10)
	(visible waypoint10 waypoint5)
	(visible waypoint5 waypoint10)
	(visible waypoint10 waypoint7)
	(visible waypoint7 waypoint10)
	(visible waypoint11 waypoint0)
	(visible waypoint0 waypoint11)
	(visible waypoint11 waypoint5)
	(visible waypoint5 waypoint11)
	(at_rock_sample waypoint0)
	(at_rock_sample waypoint1)
	(at_rock_sample waypoint4)
	(at_soil_sample waypoint5)
	(at_soil_sample waypoint6)
	(at_soil_sample waypoint7)
	(at_soil_sample waypoint9)
	(at_lander general waypoint4)
	(channel_free general)
	(at rover0 waypoint5)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint5 waypoint0)
	(can_traverse rover0 waypoint0 waypoint5)
	(can_traverse rover0 waypoint5 waypoint3)
	(can_traverse rover0 waypoint3 waypoint5)
	(can_traverse rover0 waypoint5 waypoint10)
	(can_traverse rover0 waypoint10 waypoint5)
	(can_traverse rover0 waypoint5 waypoint11)
	(can_traverse rover0 waypoint11 waypoint5)
	(can_traverse rover0 waypoint0 waypoint1)
	(can_traverse rover0 waypoint1 waypoint0)
	(can_traverse rover0 waypoint0 waypoint6)
	(can_traverse rover0 waypoint6 waypoint0)
	(can_traverse rover0 waypoint0 waypoint7)
	(can_traverse rover0 waypoint7 waypoint0)
	(can_traverse rover0 waypoint0 waypoint9)
	(can_traverse rover0 waypoint9 waypoint0)
	(can_traverse rover0 waypoint3 waypoint4)
	(can_traverse rover0 waypoint4 waypoint3)
	(can_traverse rover0 waypoint10 waypoint2)
	(can_traverse rover0 waypoint2 waypoint10)
	(can_traverse rover0 waypoint1 waypoint8)
	(can_traverse rover0 waypoint8 waypoint1)
	(at rover1 waypoint3)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_rock_analysis rover1)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint3 waypoint1)
	(can_traverse rover1 waypoint1 waypoint3)
	(can_traverse rover1 waypoint3 waypoint4)
	(can_traverse rover1 waypoint4 waypoint3)
	(can_traverse rover1 waypoint3 waypoint6)
	(can_traverse rover1 waypoint6 waypoint3)
	(can_traverse rover1 waypoint1 waypoint0)
	(can_traverse rover1 waypoint0 waypoint1)
	(can_traverse rover1 waypoint1 waypoint7)
	(can_traverse rover1 waypoint7 waypoint1)
	(can_traverse rover1 waypoint1 waypoint8)
	(can_traverse rover1 waypoint8 waypoint1)
	(can_traverse rover1 waypoint4 waypoint5)
	(can_traverse rover1 waypoint5 waypoint4)
	(can_traverse rover1 waypoint4 waypoint10)
	(can_traverse rover1 waypoint10 waypoint4)
	(can_traverse rover1 waypoint0 waypoint9)
	(can_traverse rover1 waypoint9 waypoint0)
	(can_traverse rover1 waypoint0 waypoint11)
	(can_traverse rover1 waypoint11 waypoint0)
	(can_traverse rover1 waypoint8 waypoint2)
	(can_traverse rover1 waypoint2 waypoint8)
	(on_board camera0 rover0)
	(calibration_target camera0 objective2)
	(supports camera0 colour)
	(on_board camera1 rover1)
	(calibration_target camera1 objective2)
	(supports camera1 high_res)
	(supports camera1 low_res)
	(on_board camera2 rover0)
	(calibration_target camera2 objective3)
	(supports camera2 colour)
	(visible_from objective0 waypoint0)
	(visible_from objective0 waypoint1)
	(visible_from objective0 waypoint2)
	(visible_from objective0 waypoint3)
	(visible_from objective0 waypoint5)
	(visible_from objective0 waypoint7)
	(visible_from objective0 waypoint8)
	(visible_from objective0 waypoint9)
	(visible_from objective1 waypoint11)
	(visible_from objective2 waypoint0)
	(visible_from objective2 waypoint5)
	(visible_from objective3 waypoint0)
	(visible_from objective3 waypoint1)
	(visible_from objective3 waypoint6)
	(visible_from objective3 waypoint7)
	(visible_from objective3 waypoint8)
	(visible_from objective3 waypoint9)
	(visible_from objective3 waypoint10)
)

(:goal (and
(communicated_soil_data waypoint6)
(communicated_soil_data waypoint5)
(communicated_soil_data waypoint9)
(communicated_rock_data waypoint0)
(communicated_rock_data waypoint4)
(communicated_rock_data waypoint1)
(communicated_image_data objective0 low_res)
(communicated_image_data objective3 high_res)
(communicated_image_data objective0 high_res)
	)
)
)

; plan
1. (sample_soil rover0 rover0store waypoint5)
   deleted: (empty rover0store) (at_soil_sample waypoint5)
   added: (have_soil_analysis rover0 waypoint5) (full rover0store)
   goals met: 0 of 9
2. (navigate rover1 waypoint3 waypoint4)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint4)
   goals met: 0 of 9
3. (navigate rover0 waypoint5 waypoint0)
   deleted: (at rover0 waypoint5)
   added: (at rover0 waypoint0)
   goals met: 0 of 9
4. (sample_rock rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_rock_sample waypoint4)
   added: (have_rock_analysis rover1 waypoint4) (full rover1store)
   goals met: 0 of 9
5. (communicate_soil_data rover0 general waypoint5 waypoint0 waypoint4)
   added: (communicated_soil_data waypoint5)
   goals met: 1 of 9
6. (navigate rover1 waypoint4 waypoint3)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint3)
   goals met: 1 of 9
7. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 1 of 9
8. (communicate_rock_data rover1 general waypoint4 waypoint3 waypoint4)
   added: (communicated_rock_data waypoint4)
   goals met: 2 of 9
9. (navigate rover0 waypoint0 waypoint9)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint9)
   goals met: 2 of 9
10. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 2 of 9
11. (navigate rover1 waypoint3 waypoint1)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint1)
   goals met: 2 of 9
12. (sample_soil rover0 rover0store waypoint9)
   deleted: (empty rover0store) (at_soil_sample waypoint9)
   added: (have_soil_analysis rover0 waypoint9) (full rover0store)
   goals met: 2 of 9
13. (sample_rock rover1 rover1store waypoint1)
   deleted: (empty rover1store) (at_rock_sample waypoint1)
   added: (have_rock_analysis rover1 waypoint1) (full rover1store)
   goals met: 2 of 9
14. (navigate rover0 waypoint9 waypoint0)
   deleted: (at rover0 waypoint9)
   added: (at rover0 waypoint0)
   goals met: 2 of 9
15. (navigate rover1 waypoint1 waypoint0)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint0)
   goals met: 2 of 9
16. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 2 of 9
17. (communicate_rock_data rover1 general waypoint1 waypoint0 waypoint4)
   added: (communicated_rock_data waypoint1)
   goals met: 3 of 9
18. (calibrate rover1 camera1 objective2 waypoint0)
   added: (calibrated camera1 rover1)
   goals met: 3 of 9
19. (sample_rock rover1 rover1store waypoint0)
   deleted: (empty rover1store) (at_rock_sample waypoint0)
   added: (have_rock_analysis rover1 waypoint0) (full rover1store)
   goals met: 3 of 9
20. (communicate_rock_data rover1 general waypoint0 waypoint0 waypoint4)
   added: (communicated_rock_data waypoint0)
   goals met: 4 of 9
21. (take_image rover1 waypoint0 objective0 camera1 low_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective0 low_res)
   goals met: 4 of 9
22. (calibrate rover1 camera1 objective2 waypoint0)
   added: (calibrated camera1 rover1)
   goals met: 4 of 9
23. (communicate_image_data rover1 general objective0 low_res waypoint0 waypoint4)
   added: (communicated_image_data objective0 low_res)
   goals met: 5 of 9
24. (take_image rover1 waypoint0 objective3 camera1 high_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective3 high_res)
   goals met: 5 of 9
25. (calibrate rover1 camera1 objective2 waypoint0)
   added: (calibrated camera1 rover1)
   goals met: 5 of 9
26. (communicate_image_data rover1 general objective3 high_res waypoint0 waypoint4)
   added: (communicated_image_data objective3 high_res)
   goals met: 6 of 9
27. (take_image rover1 waypoint0 objective0 camera1 high_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective0 high_res)
   goals met: 6 of 9
28. (communicate_image_data rover1 general objective0 high_res waypoint0 waypoint4)
   added: (communicated_image_data objective0 high_res)
   goals met: 7 of 9
29. (communicate_soil_data rover0 general waypoint9 waypoint0 waypoint4)
   added: (communicated_soil_data waypoint9)
   goals met: 8 of 9
30. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 8 of 9
31. (navigate rover0 waypoint0 waypoint6)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint6)
   goals met: 8 of 9
32. (sample_soil rover0 rover0store waypoint6)
   deleted: (empty rover0store) (at_soil_sample waypoint6)
   added: (have_soil_analysis rover0 waypoint6) (full rover0store)
   goals met: 8 of 9
33. (navigate rover0 waypoint6 waypoint0)
   deleted: (at rover0 waypoint6)
   added: (at rover0 waypoint0)
   goals met: 8 of 9
34. (communicate_soil_data rover0 general waypoint6 waypoint0 waypoint4)
   added: (communicated_soil_data waypoint6)
   goals met: 9 of 9
